RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_can.c
/**
 *******************************************************************************
 * @file  hc32_ll_can.c
 * @brief This file provides firmware functions to manage the CAN.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_can.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_CAN CAN
 * @brief CAN Driver Library
 * @{
 */

#if (LL_CAN_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CAN_Local_Macros CAN Local Macros
 * @{
 */

/**
 * @defgroup CAN_Check_Parameters_Validity CAN Check Parameters Validity
 * @{
 */
#define IS_CAN_BIT_MASK(x, mask)    (((x) != 0U) && (((x) | (mask)) == (mask)))

#define IS_CAN_FUNC_EN(x, en)       (((x) == 0U) || ((x) == (en)))

/* CAN unit */
#define IS_CAN_UNIT(x)              ((x) == CM_CAN)

#define IS_CAN_BIT_TIME_PRESC(x)    (((x) >= 1U) && ((x) <= 256U))

#define IS_CAN_WORK_MD(x)           ((x) <= CAN_WORK_MD_ELB_SILENT)

#define IS_CAN_TX_BUF_TYPE(x)       (((x) == CAN_TX_BUF_PTB) || ((x) == CAN_TX_BUF_STB))

#define IS_CAN_PTB_SINGLESHOT_TX(x) IS_CAN_FUNC_EN(x, CAN_PTB_SINGLESHOT_TX_ENABLE)

#define IS_CAN_STB_SINGLESHOT_TX(x) IS_CAN_FUNC_EN(x, CAN_STB_SINGLESHOT_TX_ENABLE)

#define IS_CAN_STB_PRIO_MD(x)       IS_CAN_FUNC_EN(x, CAN_STB_PRIO_MD_ENABLE)

#define IS_CAN_TX_REQ(x)            IS_CAN_BIT_MASK(x, CAN_TX_REQ_STB_ONE|CAN_TX_REQ_STB_ALL|CAN_TX_REQ_PTB)

#define IS_CAN_RX_ALL_FRAME(x)      IS_CAN_FUNC_EN(x, CAN_RX_ALL_FRAME_ENABLE)

#define IS_CAN_RX_OVF_MD(x)         (((x) == CAN_RX_OVF_SAVE_NEW) || ((x) == CAN_RX_OVF_DISCARD_NEW))

#define IS_CAN_SELF_ACK(x)          IS_CAN_FUNC_EN(x, CAN_SELF_ACK_ENABLE)

#define IS_CAN_INT(x)               IS_CAN_BIT_MASK(x, CAN_INT_ALL)

#define IS_CAN_FLAG(x)              IS_CAN_BIT_MASK(x, CAN_FLAG_ALL)

#define IS_CAN_ID(ide, x)                                                      \
(   (((ide) == 1U) && (((x) | 0x1FFFFFFFUL) == 0x1FFFFFFFUL))   ||             \
    (((ide) == 0U) && (((x) | 0x7FFUL) == 0x7FFUL)))

#define IS_CAN_ID_MASK(x)           (((x) | 0x1FFFFFFFUL) == 0x1FFFFFFFUL)

#define IS_CAN_IDE(x)               (((x) == 0U) || ((x) == 1U))

#define IS_CAN_FILTER(x)            IS_CAN_BIT_MASK(x, CAN_FILTER_ALL)

#define IS_CAN_RX_WARN(x)           (((x) >= CAN_RX_WARN_MIN) && ((x) <= CAN_RX_WARN_MAX))

#define IS_CAN_ERR_WARN(x)          ((x) < 16U)

#define IS_TTCAN_TX_BUF_MD(x)       (((x) == CAN_TTC_TX_BUF_MD_CAN) || ((x) == CAN_TTC_TX_BUF_MD_TTCAN))

#define IS_TTCAN_TX_BUF_SEL(x)      ((x) <= CAN_TTC_TX_BUF_STB4)

#define IS_TTCAN_INT(x)             IS_CAN_BIT_MASK(x, CAN_TTC_INT_ALL)

#define IS_TTCAN_FLAG(x)            IS_CAN_BIT_MASK(x, CAN_TTC_FLAG_ALL)

#define IS_TTCAN_TX_EN_WINDOW(x)    (((x) > 0U) && ((x) <= 16U))

#define IS_TTCAN_NTU_PRESCALER(x)                                              \
(   ((x) == CAN_TTC_NTU_PRESCALER1)             ||                             \
    ((x) == CAN_TTC_NTU_PRESCALER2)             ||                             \
    ((x) == CAN_TTC_NTU_PRESCALER4)             ||                             \
    ((x) == CAN_TTC_NTU_PRESCALER8))

#define IS_TTCAN_TRIG_TYPE(x)                                                  \
(   ((x) == CAN_TTC_TRIG_IMMED_TRIG)            ||                             \
    ((x) == CAN_TTC_TRIG_TIME_TRIG)             ||                             \
    ((x) == CAN_TTC_TRIG_SINGLESHOT_TX_TRIG)    ||                             \
    ((x) == CAN_TTC_TRIG_TX_START_TRIG)         ||                             \
    ((x) == CAN_TTC_TRIG_TX_STOP_TRIG))

#define IS_CAN_ID_TYPE(x)                                                      \
(   ((x) == CAN_ID_STD_EXT)                     ||                             \
    ((x) == CAN_ID_STD)                         ||                             \
    ((x) == CAN_ID_EXT))

#define IS_CAN_SBT(seg1, seg2, sjw)                                            \
(   (((seg1) >= 2U) && ((seg1) <= 65U))         &&                             \
    (((seg2) >= 1U) && ((seg2) <= 8U))          &&                             \
    (((sjw) >= 1U) && ((sjw) <= 8U))            &&                             \
    ((seg1) >= ((seg2) + 1U))                   &&                             \
    ((seg2) >= (sjw)))

/* CAN Data Length Code(DLC) */
#define IS_CAN20_DLC(fdf, dlc)                  (((fdf) == 0U) && ((dlc) <= CAN_DLC8))

/**
 * @}
 */

/**
 * @defgroup CAN_Miscellaneous_Macros CAN Miscellaneous Macros
 * @{
 */
/* CAN buffer number */
#define CAN_RX_BUF_NUM                      (10U)

#define CAN_RX_WARN_MIN                     (1U)
#define CAN_RX_WARN_MAX                     (CAN_RX_BUF_NUM)

#define CAN_ERRINT_FLAG_MASK                (CAN_ERRINT_BEIF | CAN_ERRINT_ALIF | CAN_ERRINT_EPIF)

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

