RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_can.c
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup CAN_Local_Variables CAN Local Variables
 * @{
 */
/**
 * @}
 */

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CAN_Local_Functions CAN Local Functions
 * @{
 */

#if defined __DEBUG
/**
 * @brief  Initialization parameter check.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  pstcCanInit            Pointer to a stc_can_init_t structure value that
 *                                      contains the configuration information for the CAN.
 * @retval None
 */
static void CAN_InitParameterCheck(CM_CAN_TypeDef *CANx, const stc_can_init_t *pstcCanInit)
{

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_WORK_MD(pstcCanInit->u8WorkMode));
    DDL_ASSERT(IS_CAN_PTB_SINGLESHOT_TX(pstcCanInit->u8PTBSingleShotTx));
    DDL_ASSERT(IS_CAN_STB_SINGLESHOT_TX(pstcCanInit->u8STBSingleShotTx));
    DDL_ASSERT(IS_CAN_STB_PRIO_MD(pstcCanInit->u8STBPrioMode));
    DDL_ASSERT(IS_CAN_RX_WARN(pstcCanInit->u8RxWarnLimit));
    DDL_ASSERT(IS_CAN_ERR_WARN(pstcCanInit->u8ErrorWarnLimit));
    DDL_ASSERT(IS_CAN_FILTER(pstcCanInit->u16FilterSelect));
    DDL_ASSERT(IS_CAN_RX_ALL_FRAME(pstcCanInit->u8RxAllFrame));
    DDL_ASSERT(IS_CAN_RX_OVF_MD(pstcCanInit->u8RxOvfMode));
    DDL_ASSERT(IS_CAN_SELF_ACK(pstcCanInit->u8SelfAck));

    DDL_ASSERT(IS_CAN_BIT_TIME_PRESC(pstcCanInit->stcBitCfg.u32Prescaler));
    DDL_ASSERT(IS_CAN_SBT(pstcCanInit->stcBitCfg.u32TimeSeg1,
                          pstcCanInit->stcBitCfg.u32TimeSeg2,
                          pstcCanInit->stcBitCfg.u32SJW));
}
#endif

/**
 * @brief  Specifies work mode for the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u8WorkMode             Work mode of CAN.
 *                                      This parameter can be a value of @ref CAN_Work_Mode
 *   @arg  CAN_WORK_MD_NORMAL:          Normal work mode.
 *   @arg  CAN_WORK_MD_SILENT:          Silent work mode. Prohibit data transmission.
 *   @arg  CAN_WORK_MD_ILB:             Internal loop back mode, just for self-test while developing.
 *   @arg  CAN_WORK_MD_ELB:             External loop back mode, just for self-test while developing.
 *   @arg  CAN_WORK_MD_ELB_SILENT:      External lopp back silent mode, just for self-test while developing.
 *                                      It is forbidden to respond to received frames and error frames,
 *                                      but data can be transmitted.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
static void CAN_SetWorkMode(CM_CAN_TypeDef *CANx, uint8_t u8WorkMode)
{
    uint8_t u8CFGSTAT = 0U;
    uint8_t u8TCMD    = 0U;

    switch (u8WorkMode) {
        case CAN_WORK_MD_SILENT:
            u8TCMD    = CAN_TCMD_LOM;
            break;
        case CAN_WORK_MD_ILB:
            u8CFGSTAT = CAN_CFG_STAT_LBMI;
            break;
        case CAN_WORK_MD_ELB:
            u8CFGSTAT = CAN_CFG_STAT_LBME;
            break;
        case CAN_WORK_MD_ELB_SILENT:
            u8TCMD    = CAN_TCMD_LOM;
            u8CFGSTAT = CAN_CFG_STAT_LBME;
            break;
        case CAN_WORK_MD_NORMAL:
        default:
            break;
    }

    MODIFY_REG8(CANx->CFG_STAT, CAN_CFG_STAT_LBMI | CAN_CFG_STAT_LBME, u8CFGSTAT);
    MODIFY_REG8(CANx->TCMD, CAN_TCMD_LOM, u8TCMD);
}

/**
 * @brief  Configures acceptance filter. Set ID and ID mask for the specified acceptance filters.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u16FilterSelect        Acceptance filters selection.
 *                                      This parameter can be values of @ref CAN_Acceptance_Filter
 * @param  [in]  pstcFilter             Pointer to a stc_can_filter_config_t structure type array which contains ID and ID mask
 *                                      values for the acceptance filters specified by parameter u16FilterSelect.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       If one the following cases matches:
 *                                      - u16FilterSelect == 0U.
 *                                      - pstcFilter == NULL.
 * @note Call this function when CFG_STAT.RESET is 1.
 */
static int32_t CAN_FilterConfig(CM_CAN_TypeDef *CANx, uint16_t u16FilterSelect,
                                const stc_can_filter_config_t *pstcFilter)
{
    uint8_t u8FilterAddr = 0U;
    uint8_t i = 0U;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_CAN_UNIT(CANx));

    if ((u16FilterSelect != 0U) && (pstcFilter != NULL)) {
        while (u16FilterSelect != 0U) {
            if ((u16FilterSelect & 0x1U) != 0U) {
                DDL_ASSERT(IS_CAN_ID_TYPE(pstcFilter[i].u32IDType));
                DDL_ASSERT(IS_CAN_ID_MASK(pstcFilter[i].u32IDMask));
                WRITE_REG8(CANx->ACFCTRL, u8FilterAddr);
                WRITE_REG32(CANx->ACF, pstcFilter[i].u32ID);
                SET_REG8_BIT(CANx->ACFCTRL, CAN_ACFCTRL_SELMASK);
                WRITE_REG32(CANx->ACF, pstcFilter[i].u32IDMask | pstcFilter[i].u32IDType);
                i++;
            }
            u16FilterSelect >>= 1U;
            u8FilterAddr++;
        }

