RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_can.c
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Write TX buffer register in bytes.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  pstcTx                 Pointer to a @ref stc_can_tx_frame_t structure.
 * @retval None
 */
static void CAN_WriteTxBuf(CM_CAN_TypeDef *CANx, const stc_can_tx_frame_t *pstcTx)
{
    uint8_t i;
    uint8_t u8WordLen;
    __IO uint32_t *reg32TBUF;
    uint32_t *pu32TxData = (uint32_t *)((uint32_t)(&pstcTx->au8Data[0U]));

    reg32TBUF = (__IO uint32_t *)((uint32_t)&CANx->TBUF);
    reg32TBUF[0U] = pstcTx->u32ID;
    reg32TBUF[1U] = pstcTx->u32Ctrl;

    if (pstcTx->DLC != CAN_DLC0) {
        u8WordLen = (uint8_t)((pstcTx->DLC + 3U) / 4U);
        for (i = 0U; i < u8WordLen; i++) {
            reg32TBUF[2U + i] = pu32TxData[i];
        }
    }
}

/**
 * @brief  Read RX buffer register in bytes.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  pstcRx                 Pointer to a @ref stc_can_rx_frame_t structure.
 * @retval None
 */
static void CAN_ReadRxBuf(const CM_CAN_TypeDef *CANx, stc_can_rx_frame_t *pstcRx)
{
    __I uint32_t *reg32RBUF;
    uint8_t i;
    uint8_t u8WordLen;
    uint32_t *pu32RxData = (uint32_t *)((uint32_t)(&pstcRx->au8Data[0U]));

    reg32RBUF = (__I uint32_t *)((uint32_t)&CANx->RBUF);
    pstcRx->u32ID   = reg32RBUF[0U];
    pstcRx->u32Ctrl = reg32RBUF[1U];

    u8WordLen = (uint8_t)((pstcRx->DLC + 3U) / 4U);
    for (i = 0U; i < u8WordLen; i++) {
        pu32RxData[i] = reg32RBUF[2U + i];
    }
}

/**
 * @}
 */

/**
 * @defgroup CAN_Global_Functions CAN Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified CAN peripheral according to the specified parameters
 *         in the structure pstcCanInit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  pstcCanInit            Pointer to a @ref stc_can_init_t structure value that
 *                                      contains the configuration information for the CAN.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcCanInit == NULL
 */
int32_t CAN_Init(CM_CAN_TypeDef *CANx, const stc_can_init_t *pstcCanInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (pstcCanInit != NULL) {
#if defined __DEBUG
        CAN_InitParameterCheck(CANx, pstcCanInit);
#endif /* __DEBUG */

        /* Software reset. */
        SET_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_RESET);
        /* Configures nominal bit time. */
        WRITE_REG32(CANx->SBT, ((pstcCanInit->stcBitCfg.u32TimeSeg1 - 2U) | \
                                ((pstcCanInit->stcBitCfg.u32TimeSeg2 - 1U) << CAN_SBT_S_SEG_2_POS) | \
                                ((pstcCanInit->stcBitCfg.u32SJW - 1U) << CAN_SBT_S_SJW_POS) | \
                                ((pstcCanInit->stcBitCfg.u32Prescaler - 1U) << CAN_SBT_S_PRESC_POS)));
        /* Enable or disable STB priority mode. */
        MODIFY_REG8(CANx->TCTRL, CAN_TCTRL_TSMODE, pstcCanInit->u8STBPrioMode);
        /* Configures acceptance filters. */
        (void)CAN_FilterConfig(CANx, pstcCanInit->u16FilterSelect, pstcCanInit->pstcFilter);

        /* Configures CAN-FD */

        /* CAN enters normal communication mode. */
        CLR_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_RESET);
        /* Specifies CAN work mode. */
        CAN_SetWorkMode(CANx, pstcCanInit->u8WorkMode);
        /* Enable or disable single shot transmission mode of PTB and STB. */
        MODIFY_REG8(CANx->CFG_STAT, \
                    (CAN_CFG_STAT_TPSS | CAN_CFG_STAT_TSSS), \
                    (pstcCanInit->u8PTBSingleShotTx | pstcCanInit->u8STBSingleShotTx));
        /* Specifies receive buffer almost full warning limit. Specifies error warning limit. */
        WRITE_REG8(CANx->LIMIT, ((pstcCanInit->u8RxWarnLimit << CAN_LIMIT_AFWL_POS) | pstcCanInit->u8ErrorWarnLimit));

        /* Enable or disable RX all frames(include frames with error).
           Specifies receive overflow mode. In case of a full rx buffer when a new message is received.
           Enable or disable self-acknowledge. */
        WRITE_REG8(CANx->RCTRL, pstcCanInit->u8RxAllFrame | \
                   pstcCanInit->u8RxOvfMode  | \
                   pstcCanInit->u8SelfAck);
        /* Enable acceptance filters that configured before. */
        WRITE_REG8(CANx->ACFEN, pstcCanInit->u16FilterSelect);
        /* Configures TTCAN if needed. */
        if (pstcCanInit->pstcCanTtc != NULL) {
            (void)CAN_TTC_Config(CANx, pstcCanInit->pstcCanTtc);
        }

        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Set each @ref stc_can_init_t field to a default value.
 *         Classical CAN bit time configuration:
 *         Based on 40MHz CAN clock, TQ clock is CAN clock divided by 4.
 *         Bit rate 500Kbps, 1 bit time is 20TQs, sample point is 80%.
 *         CAN-FD bit time configuration:
 *         Based on 40MHz CAN clock, TQ clock is CAN clock divided by 1.
 *         Bit rate 2Mbps, 1 bit time is 20TQs, primary sample point is 80%,
 *         secondary sample point is 80%.
 * @param  [in]  pstcCanInit            Pointer to a @ref stc_can_init_t structure
 *                                      whose fields will be set to default values.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcCanInit == NULL.
 */
int32_t CAN_StructInit(stc_can_init_t *pstcCanInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

