RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_can.c
    if (pstcTx != NULL) {
        DDL_ASSERT(IS_CAN20_DLC(pstcTx->FDF, pstcTx->DLC));

#if defined __DEBUG
        if (pstcTx->RTR == 1U) {
            DDL_ASSERT(pstcTx->DLC != CAN_DLC0);
        }
#endif
        i32Ret = LL_OK;

        if (((pstcTx->FDF == 1U) && ((pstcTx->u32ID & 0x8UL) == 0x8UL)) || \
                ((pstcTx->RTR == 1U) && (pstcTx->DLC == CAN_DLC0))) {
            i32Ret = LL_ERR_INVD_PARAM;
        }

        if (i32Ret == LL_OK) {
            if (u8TxBufType == CAN_TX_BUF_PTB) {
                if (READ_REG8_BIT(CANx->TCMD, CAN_TCMD_TPE) != 0U) {
                    /* PTB is being transmitted. */
                    i32Ret = LL_ERR_BUSY;
                }
            } else {
                if (READ_REG8_BIT(CANx->TCMD, (CAN_TCMD_TSONE | CAN_TCMD_TSALL)) != 0U) {
                    /* STB is being transmitted. */
                    i32Ret = LL_ERR_BUSY;
                } else {
                    if (READ_REG8_BIT(CANx->RTIE, CAN_RTIE_TSFF) != 0U) {
                        /* All STBs are filled. */
                        i32Ret = LL_ERR_BUF_FULL;
                    }
                }
            }
        }

        if (i32Ret == LL_OK) {
            /* Assert ID */
            DDL_ASSERT(IS_CAN_ID(pstcTx->IDE, pstcTx->u32ID));

            /* Specifies the transmit buffer, PTB or STB. */
            u32RegAddr = (uint32_t)&CANx->TCMD;
            WRITE_REG32(PERIPH_BIT_BAND(u32RegAddr, CAN_TCMD_TBSEL_POS), u8TxBufType);

            CAN_WriteTxBuf(CANx, pstcTx);

            if (u8TxBufType == CAN_TX_BUF_STB) {
                /* After writes the data in transmit buffer(TB), sets the TSNEXT bit to indicate that the current
                   STB slot has been filled, so that the hardware will point TB to the next STB slot. */
                SET_REG8_BIT(CANx->TCTRL, CAN_TCTRL_TSNEXT);
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Starts transmission.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u8TxRequest            The transmit buffer to be transmitted.
 *                                      This parameter can be values of @ref CAN_Tx_Request
 *   @arg  CAN_TX_REQ_STB_ONE:          Transmit one STB frame.
 *   @arg  CAN_TX_REQ_STB_ALL:          Transmit all STB frames.
 *   @arg  CAN_TX_REQ_PTB:              Transmit PTB frame.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
void CAN_StartTx(CM_CAN_TypeDef *CANx, uint8_t u8TxRequest)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TX_REQ(u8TxRequest));
    SET_REG8_BIT(CANx->TCMD, u8TxRequest);
}

/**
 * @brief  Abort the transmission of the specified transmit buffer.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u8TxBufType            The transmit buffer to be aborted.
 *                                      This parameter can be a value of @ref CAN_Tx_Buf_Type
 *   @arg  CAN_TX_BUF_PTB:              Abort PTB transmission.
 *   @arg  CAN_TX_BUF_STB:              Abort STB transmission.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
void CAN_AbortTx(CM_CAN_TypeDef *CANx, uint8_t u8TxBufType)
{
    uint8_t au8Abort[] = {CAN_TCMD_TPA, CAN_TCMD_TSA};

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TX_BUF_TYPE(u8TxBufType));
    SET_REG8_BIT(CANx->TCMD, au8Abort[u8TxBufType]);
}

/**
 * @brief  Get one received frame.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [out] pstcRx                 Pointer to a @ref stc_can_rx_frame_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Get one received frame successfully.
 *           - LL_ERR_BUF_EMPTY:        Receive buffer is empty, and no frame has been read.
 *           - LL_ERR_INVD_PARAM:       pstcRx == NULL.
 */
int32_t CAN_GetRxFrame(CM_CAN_TypeDef *CANx, stc_can_rx_frame_t *pstcRx)
{
    int32_t i32Ret = LL_ERR_BUF_EMPTY;

    DDL_ASSERT(IS_CAN_UNIT(CANx));

    if (pstcRx == NULL) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        if (READ_REG8_BIT(CANx->RCTRL, CAN_RCTRL_RSTAT) != CAN_RX_BUF_EMPTY) {
            CAN_ReadRxBuf(CANx, pstcRx);
            /* Set RB to point to the next RB slot. */
            SET_REG8_BIT(CANx->RCTRL, CAN_RCTRL_RREL);

            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Get the status of specified flag.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u32Flag                CAN status flag.
 *                                      This parameter can be a value of @ref CAN_Status_Flag
 *   @arg  CAN_FLAG_BUS_OFF:            Register bit CFG_STAT.BUSOFF. CAN bus off.
 *   @arg  CAN_FLAG_TX_GOING:           Register bit CFG_STAT.TACTIVE. CAN bus is transmitting.
 *   @arg  CAN_FLAG_RX_GOING:           Register bit CFG_STAT.RACTIVE. CAN bus is receiving.
 *   @arg  CAN_FLAG_RX_BUF_OVF:         Register bit RCTRL.ROV. Receive buffer is full and there is a further bit to be stored. At least one data is lost.
 *   @arg  CAN_FLAG_TX_BUF_FULL:        Register bit RTIE.TSFF. Transmit buffers are all full:
 *                                      TTCFG.TTEN == 0 or TCTRL.TTTEM == 0: ALL STB slots are filled.
 *                                      TTCFG.TTEN == 1 and TCTRL.TTTEM == 1: Transmit buffer that pointed by TBSLOT.TBPTR is filled.
 *   @arg  CAN_FLAG_TX_ABORTED:         Register bit RTIF.AIF. Transmit messages requested via TCMD.TPA and TCMD.TSA were successfully canceled.
 *   @arg  CAN_FLAG_ERR_INT:            Register bit RTIF.EIF. The CFG_STAT.BUSOFF bit changes, or the relative relationship between the value of the error counter and the
 *                                      set value of the ERROR warning limit changes. For example, the value of the error counter changes from less than
 *                                      the set value to greater than the set value, or from greater than the set value to less than the set value.
 *   @arg  CAN_FLAG_STB_TX:             Register bit RTIF.TSIF. STB was transmitted successfully.
 *   @arg  CAN_FLAG_PTB_TX:             Register bit RTIF.TPIF. PTB was transmitted successfully.
 *   @arg  CAN_FLAG_RX_BUF_WARN:        Register bit RTIF.RAFIF. The number of filled RB slot is greater than or equal to the LIMIT.AFWL setting value.
 *   @arg  CAN_FLAG_RX_BUF_FULL:        Register bit RTIF.RFIF. The FIFO of receive buffer is full.
 *   @arg  CAN_FLAG_RX_OVERRUN:         Register bit RTIF.ROIF. Receive buffers are all full and there is a further message to be stored.
 *   @arg  CAN_FLAG_RX:                 Register bit RTIF.RIF. Received a valid data frame or remote frame.
 *   @arg  CAN_FLAG_BUS_ERR:            Register bit ERRINT.BEIF. In case of an error, KOER and the error counters get updated. BEIF gets set if BEIE is enabled
 *                                      and the other error interrupt flags will act accordingly.
 *   @arg  CAN_FLAG_ARBITR_LOST:        Register bit ERRINT.ALIF. Arbitration lost.
 *   @arg  CAN_FLAG_ERR_PASSIVE:        Register bit ERRINT.EPIF. A change from error-passive to error-active or error-active to error-passive has occurred.
 *   @arg  CAN_FLAG_ERR_PASSIVE_NODE:   Register bit ERRINT.EPASS. The node is an error-passive node.
 *   @arg  CAN_FLAG_TEC_REC_WARN:       Register bit ERRINT.EWARN. REC or TEC is greater than or equal to the LIMIT.EWL setting value.
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t CAN_GetStatus(const CM_CAN_TypeDef *CANx, uint32_t u32Flag)
{
    uint8_t u8CFGSTAT;
    uint8_t u8RCTRL;
    uint8_t u8RTIE;
    uint8_t u8RTIF;
    uint8_t u8ERRINT;
    en_flag_status_t enStatus = RESET;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_FLAG(u32Flag));

    u8CFGSTAT = (uint8_t)(u32Flag);
    u8RCTRL   = (uint8_t)(u32Flag & CAN_FLAG_RX_BUF_OVF);
    u8RTIE    = (uint8_t)(u32Flag >> 8U);
    u8RTIF    = (uint8_t)(u32Flag >> 16U);
    u8ERRINT  = (uint8_t)(u32Flag >> 24U);

