RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_can.c
    u8Reg   = READ_REG8(CANx->TTCFG);
    u8Reg  &= (uint8_t)(~CAN_TTC_FLAG_ALL);
    u8Reg  |= u8Flag;
    WRITE_REG8(CANx->TTCFG, u8Reg);
}

/**
 * @brief  Get the status value of TTCAN.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @retval An uint8_t type value that includes the flowing status flags.
 *         - CAN_TTC_FLAG_TIME_TRIG:    Time trigger interrupt flag.
 *         - CAN_TTC_FLAG_TRIG_ERR:     Trigger error interrupt flag.
 *         - CAN_TTC_FLAG_WATCH_TRIG:   Watch trigger interrupt flag.
 */
uint8_t CAN_TTC_GetStatusValue(const CM_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return READ_REG8_BIT(CANx->TTCFG, CAN_TTC_FLAG_ALL);
}

/**
 * @brief  Specifies trigger type of TTCAN.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u16TriggerType         TTCAN trigger type.
 *                                      This parameter can be a value of @ref TTCAN_Trigger_Type
 *   @arg  CAN_TTC_TRIG_IMMED_TRIG:     Immediate trigger for immediate transmission.
 *   @arg  CAN_TTC_TRIG_TIME_TRIG:      Time trigger for receive triggers.
 *   @arg  CAN_TTC_TRIG_SINGLESHOT_TX_TRIG: Single shot transmit trigger for exclusive time windows.
 *   @arg  CAN_TTC_TRIG_TX_START_TRIG:  Transmit start trigger for merged arbitrating time windows.
 *   @arg  CAN_TTC_TRIG_TX_STOP_TRIG:   Transmit stop trigger for merged arbitrating time windows.
 * @retval None
 */
void CAN_TTC_SetTriggerType(CM_CAN_TypeDef *CANx, uint16_t u16TriggerType)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_TTCAN_TRIG_TYPE(u16TriggerType));
    MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TTYPE, u16TriggerType);
}

/**
 * @brief  Specifies transmit enable window time of TTCAN.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u16TxEnableWindow      Number of NTU. Time period within which the transmit of a message may be started.
 * @retval None
 */
void CAN_TTC_SetTxEnableWindow(CM_CAN_TypeDef *CANx, uint16_t u16TxEnableWindow)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_TTCAN_TX_EN_WINDOW(u16TxEnableWindow));
    MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TEW, (u16TxEnableWindow - 1U) << CAN_TRG_CFG_TEW_POS);
}

/**
 * @brief  Specifies transmit trigger time of TTCAN.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u16TxTriggerTime       Transmit trigger time(number of NTU).
 * @retval None
 */
void CAN_TTC_SetTxTriggerTime(CM_CAN_TypeDef *CANx, uint16_t u16TxTriggerTime)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    WRITE_REG16(CANx->TT_TRIG, u16TxTriggerTime);
}

/**
 * @brief  TTCAN specifies watch-trigger time.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u16WatchTriggerTime    Watch trigger time(number of NTU).
 * @retval None
 */
void CAN_TTC_SetWatchTriggerTime(CM_CAN_TypeDef *CANx, uint16_t u16WatchTriggerTime)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    WRITE_REG16(CANx->TT_WTRIG, u16WatchTriggerTime);
}

/**
 * @brief  TTCAN fill transmit frame.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [in]  u8CANTTCTxBuf          TTCAN transmit buffer selection.
 *                                      This parameter can be a value of @ref TTCAN_Tx_Buf_Sel
 * @param  [in]  pstcTx                 Pointer to a @ref stc_can_tx_frame_t structure.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcTx == NULL.
 *           - LL_ERR_BUF_FULL:         The target transmit buffer is full.
 */
int32_t CAN_TTC_FillTxFrame(CM_CAN_TypeDef *CANx, uint8_t u8CANTTCTxBuf, const stc_can_tx_frame_t *pstcTx)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_TTCAN_TX_BUF_SEL(u8CANTTCTxBuf));

    if (pstcTx != NULL) {
        DDL_ASSERT(IS_CAN20_DLC(pstcTx->FDF, pstcTx->DLC));

        if (READ_REG8_BIT(CANx->TCTRL, CAN_TX_BUF_FULL) == CAN_TX_BUF_FULL) {
            i32Ret = LL_ERR_BUF_FULL;
        } else {
            WRITE_REG8(CANx->TBSLOT, u8CANTTCTxBuf);
            MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TTPTR, u8CANTTCTxBuf);
            CAN_WriteTxBuf(CANx, pstcTx);

            /* Set buffer as filled. */
            SET_REG8_BIT(CANx->TBSLOT, CAN_TBSLOT_TBF);

            /* Write MSB of TT_TRIG to transmit. */
            WRITE_REG16(CANx->TT_TRIG, CANx->TT_TRIG);

            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Get the configuration of TTCAN.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_CAN or CM_CANx:           CAN instance register base.
 * @param  [out] pstcCanTtc             Pointer to a @ref stc_can_ttc_config_t structure.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcCanTtc == NULL.
 */
int32_t CAN_TTC_GetConfig(const CM_CAN_TypeDef *CANx, stc_can_ttc_config_t *pstcCanTtc)
{
    uint32_t u32Tmp;
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (pstcCanTtc != NULL) {
        u32Tmp = READ_REG32(CANx->REF_MSG);
        pstcCanTtc->u8TxBufMode         = READ_REG8_BIT(CANx->TCTRL, CAN_TCTRL_TTTBM);
        pstcCanTtc->u8NTUPrescaler      = READ_REG8_BIT(CANx->TTCFG, CAN_TTCFG_T_PRESC);
        pstcCanTtc->u32RefMsgIDE        = (u32Tmp >> CAN_REF_MSG_REF_IDE_POS) & 0x1UL;
        pstcCanTtc->u32RefMsgID         = u32Tmp & 0x7FFFFFFFUL;
        pstcCanTtc->u16TriggerType      = READ_REG16_BIT(CANx->TRG_CFG, CAN_TRG_CFG_TTYPE);
        pstcCanTtc->u16TxEnableWindow   = (READ_REG16_BIT(CANx->TRG_CFG, CAN_TRG_CFG_TEW) >> CAN_TRG_CFG_TEW_POS) + 1U;
        pstcCanTtc->u16TxTriggerTime    = READ_REG16(CANx->TT_TRIG);
        pstcCanTtc->u16WatchTriggerTime = READ_REG16(CANx->TT_WTRIG);

        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @}
 */

#endif /* LL_CAN_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
